[
  {
    "id": "8a7b6c5d-4e3f-2d1c-0b9a-8a7b6c5d4e3f",
    "title": "Learning Rust with Yew",
    "content": "I set out to build this website as a way to learn Rust as a new language to me. \n I started off my career coding in Python and then later Java as I have worked on developer productivity with Gradle. \n Rust has so many interesting use cases on its own but also I find myself drawn to trying to use Rust \n along with PyO3 and Maturin to make better Python libraries.",
    "author": "C. James",
    "created_at": "2025-03-22T21:30:00Z",
    "updated_at": null,
    "tags": ["rust", "yew"]
  },
  {
    "id": "1b2c3d4e-5f6a-7b8c-9d0e-1b2c3d4e5f6a",
    "title": "Philosophy of Slavoj Zizek ",
    "content": "What Zizek brings into the theory of the sublime object shows his understanding starting from both the philosophical tradition beginning with Immanuel Kant and then in the psychoanalytic tradition with Jacques Lacan. Zizek seems to show a synthesis of the philosophical and psychoanalytic tradition within his theory of the sublime object. I will draw from Kant and his theory to gain understanding as to what Zizek has been set forth with philosophically and what Zizek changes within his own theory of the Sublime object and adds with his psychoanalytic background. \u2028We can begin with Immanuel Kant’s version of the sublime. But to first understand Kant’s theories on the sublime, we must understand where in his works that this theory is set. His theory is set in the works of the three critiques, which are critique of pure reason, practical reason, and judgment. Kant’s theory on the sublime is found in his last work, Critique of Judgment. \u2028The sublime is merely one of four categories of delight that Kant defines. The categories of delight are good, which is a universal and from intellect; agreeable, being particular and occurs from taste; sublime, that is particular and is from intellect; and beautiful, is universal and comes from taste. In which Kant defines sublime as ‘the mere ability to think which shows a faculty of the mind surpassing every standard of sense.’ Furthermore it is an object that it is beyond all that which is small. This means that the sublime object is something that is so large that it is impossible for the mind to fully grasp it. The difference between beauty and sublime must be distinguished. Beauty is the sensibility of the system and sublime is more linked with the practical reason of the system. Frederick Jameson gives a further definition of Kant’s sublime as: \u2028‘The sublime was for Burke an experience bordering terror, the fitful glimpse, in astonishment, stupor, and awe, of what was so enormous as to crush human life altogether: a description then refined by Kant to include the representation itself, so that the object of the sublime becomes not only a matter of sheer power and of the physical incommensurability of the human organism with nature but also of the limits of figuration and the incapacity of the human mind to give representation to such enormous forces.’ \u2028\u2028The sublime is characterized by being infinite or unbound. The desire for the sublime is ‘by no means a liking for the object (since it may be formless), but rather a liking of the expansion of the imagination itself.’ For Kant, one experiences the feeling of sublime when there is both a displeasure making us alive to our ‘supersensible side of our being’ and also a pleasure finding ‘every standard of sensibility falling short of the ideas of reason.’ There are 4 categories for the delight of the sublime, defined by Kant as quality, as independent of interest; quantity, shown universally valid; relation, subjective finality; and modality, it must be necessary. Part of what makes the sublime some-Thing that can be feared for Kant comes from his placing it in moral terms, the moral man will experience the delight of the sublime, but the amoral man will experience a feeling of terror. Thus the sublime feeling is one that is paradoxical. This paradox is best placed in Kant when he refers to it being both a feeling of pain and pleasure simultaneously. \u2028It is here that we then find Zizek making his synthesis of Kantian sublime and the psychoanalytic tradition of the sublime. It is very clear when Zizek uses the Oedipus myth to demonstrate his understanding of the sublime object that he is bringing both Kant and Lacan together. \u2028Accordingly, Antigone, the daughter of Oedipus, provides the perfect example for a sublime object in Zizek’s theory. The Oedipus myth can explain one way in which a sublime object comes about. In this case there are three parts, first of which being the original sin. In the case of the Oedipus myth, it is Oedipus’ parents disowning their son. There is in accordance with this is an unwanted object, Oedipus himself. Finally, what occurs is the sublime object, Antigone, who is a descendent or offspring of the abject or unwanted object. Antigone is then idolized and becomes the focus of desire. This idea for Zizek is something that he sees in art and makes the analogy that it is no longer that which is going from ‘beauty to trash’ but indeed we are taking ‘trash and making it beautiful’ Zizek does use this example in reading Kant on the sublime. \u2028There is also another sense of Antigone as sublime. That is in the Kantian sense of sublime, in that she is sublime for her sacrificing, apropos ‘the overwhelming infinity of sacrificed empirical objects brings home in a negative way the enormous, incomprehensible dimension of the Thing for which one sacrifices them. So Antigone is sublime in her sad enumeration of what she is sacrificing.’ \u2028\u2028The sublime object is an object that is a part of ordinary life and becomes elevated into the ‘Thing’, Zizek gives the example of the holocaust as an event in which such occurs. This idea is also where ethics or morality enters in where ‘today the only absolute is that of sublime/irrepresentable evil.’ This precisely is where Zizek enters into the talk on September 11th and the WTC attacks and saying that the worst thing to do is to elevated the events to that absolute. Slavoj Zizek gives a good definition of what the ‘Thing’ is, ‘there is no Thing behind its sublime appearance- that if we force our way through the sublime appearance to the thing itself, all we will get is a suffocating nausea of the abject…’ Or in other words, there is no object that occurs behind the sublime appearance. What we come to here is Zizek’s example of Caffeine Free Diet Coke as objet petit a. That is to say that we in this case actually desire something that at its prime is nothingness in the guise of something. Zizek places the analogy as:\u2028‘We drink Coke-or any drink- for two reasons: for its thirst quenching or nutritional value, and for its taste. In the case of caffeine free diet coke, nutritional value is suspended and the caffeine, as the key ingredient of its taste, is also taken away…’ \u2028\u2028This concept of nothingness as being behind the object that it is merely an appearance and a full object is where Zizek splits from Kantian terms of sublime. Zizek takes this idea and begins to mold a view of sublime that is Kantian influenced but has its own twists on what Kant gave as the sublime. \u2028The sublime object becomes, for Zizek, an unconditional object that is valued more than life itself for the subject. At the same time the sublime object is also an anamorphic object. Anamorphosis can be seen as that which ‘designates an object whose material reality is distorted in such a way that a gaze is inscribed into its objective features.’ That is to say that we cannot perceive the sublime of the object unless we are looking at it ‘awry’. Otherwise, it is merely just another object. The idea of approaching an object from an ‘awry’ perception is key to understanding the sublime object. That is to say you approach the object in an abnormal way. This is also why the sublime object is also anamorphic. The object takes on the ‘awry’ perception that we place upon it. What then does it mean to look at an object ‘awry’? \u2028Zizek finds the basis for such notion in Hegel’s Phenomenology of Spirit, ‘the basic strategy of Hegel’s Phenomenology of Spirit to undermine a given theoretical position by “staging” it as an existential subjective attitude and thus to reveal its otherwise hidden inconsistencies, that is to exhibit the way its very subjective position of enunciation undermines its enunciated, its positive contents.’ One should also at least mention here Zeno and his paradoxes as another example of ‘looking awry’. Zeno takes his paradoxes and through their absurdity used them to prove his teacher, Parmenides, thesis to be right. It is precisely this finding the absurdity that Zeno uses that can be ‘looking awry’ in some sense. We must look at the ‘absurdity’ of an object for it to become the sublime object. \u2028This is to be understood also in regards to the gap between the object and the impossible Thing. Sublimation is when the object becomes a ‘stand in’ for the Thing. The gap that Zizek points us to can be given the name of the ‘Real’, where is a point when someone gets to close to the object and it becomes a sort of disgust rather than a focus of ‘erotic fascination’. For Zizek the real can be screened, and this is seen in his analysis of the blockbuster movie The Matrix where in the movie the matrix screens people from the real, but also for Lacan the Real is the screen itself. More so Zizek uses the example of\u2028‘the ultimate figure of passion of the real, the option we get on hardcore websites to observe the inside of a vagina from the vantage point of a tiny camera at the top of a penetrating dildo…at this extreme point, a shift occurs: when we get too close to the desired object, erotic fascination turns into disgust at the real of the bare flesh.’ \u2028\u2028The only thing we can do ‘is encircle’ the object of desire and the paradox is that we can never obtain the object cause of our desire. The ‘Real’ for Zizek can be seen as ‘the terrible thing that is impossible to confront face to face, as the ultimate Real concealed beneath the layers of imaginary and/or symbolic veils: the very idea that, beneath the deceptive appearances, there lies hidden some ultimate Real Thing too horrible for us to look at directly is the ultimate appearance…’ The ‘Real’ for Zizek is such that we will never come to such without having some sort of sense of horror. It seems to be then that this fits for all those that are a ‘Thing’ labeled as monstrous are those that are in the gap of the ‘Real’. The ultimate example of something that is the ‘Real’ is that of fetishism. An example could be a woman that always fantasizes about a scenario or role playing sexual episode with her partner where she plays the victim of being raped. She consistently fantasizes about such an activity; however when this episode finally occurs, she feels as though she has actually been raped. So then her fantasy has become monstrous to her. She no longer confronts such as fantasy but as nightmare. \u2028Along with such an idea is a tragedy; which Zizek claims that there is no greater tragedy than on the behalf of the fidelity of the object one sacrifices the Second (eternal) life. Going back to the idea of the gap of the ‘Real’, Zizek equates that ‘comedy and tragedy both rely on the gap…’ so the greatest tragedy is one that requires great strength. Strength as such that a fragile individual gains such strength that he also pays the highest price for his fidelity to the ‘Thing’. To gain a good idea of price one pays for fidelity to the ‘Thing’. One could look at the movie which Zizek gives insight on, Life Is Beautiful. There is a moment when Life is Beautiful moves from comedy to tragedy. It is in the point of recapturing dignity on a deeper level when the Father uses trickery to save his son and the basic underlying dignity becomes witnessed. So that one wants to laugh at the sort of things the father says to his son to keep him safe, but then there is the movement where one realizes that the father is going to die to save his son, bringing about a sort of feeling of sadness to the viewer. \u2028Zizek uses this idea to shed light onto the ‘horror of the modern condition’ which is taken from Lacan. Furthermore, Zizek gives reason of the importance of this transition from comedy to tragedy by explaining that \u2028‘the victims of concentration camps or the victims of the Stalinist show trials were not in a properly tragic predicament; their situation was not without comic- or, at least, ridiculous-aspects; and, for that reason, all the more horrifying- there is a horror so deep that it can no longer be ‘sublimated’ into tragic dignity…’ \u2028\u2028This seems to show what happens in the transition in Life is Beautiful so that there is that comic aspect to a movie about something that is usually seen as utterly tragic. This is exactly the paradox that one feels when confronted with the sublime.\u2028The sublime is a paradox that is hard to put a complete definition upon; however, the main aspect is that it is a sort of paradox between comedy and tragedy. An object that is desired but at the same time feared greatly if encountered in the wrong context. \u2028For Zizek the whole process of sublimation, which I have been laying out, can be found in that of Christian love. Zizek defines Christian love as ‘a violent passion to introduce a difference, a gap in the order of being, to privilege and elevate some objects at the expense of others.’ Christian love then is the privileging certain objects and making them sublime but at the cost of other objects. This cost is the violence, one which comes from love that ‘tears its object out of its context, elevating it to the Thing.’ This violence can be seen in the wife that is a victim of domestic violence and when it stops she thinks that her husband no longer loves her. Love in a sense is a decontextualizing of an object then. It is exactly this process that makes key for Zizek the relationship between self and the other. \u2028It is the sublime and our relationship to it that is key to understanding what exactly Zizek contends on his theory for the monstrous. Zizek tells us that the thing we perceive as sublime is never by itself sublime, however that sublimity is always ‘for us’ or is a subjective effect. This does not mean that the sublime is not real, but merely depends upon how our subjective perspective on objective reality is situated in reality itself. The overarching idea for Zizek and will be that of sublimity and monstrosity is not different in content of object but merely our distance from the alterity or Other.\n\n\n\n\n\n\nzek’s understanding of the ‘Real’ is what shapes his understanding of politics proper. What we find is that Zizek draws here solely from the psychoanalytic tradition and is focused upon Lacan. So that Zizek reads psychoanalysis with politics proper. Just as in the sublime object, Zizek here makes a synthesis of politics proper and psychoanalysis in the theory of the real. \u2028As seen when talking about the sublime object, the real is the gap that separates the object and the thing. The real is at the same time both the ‘Thing to which direct access is not possible and the obstacle that prevents this direct access.’ Or in other words, what prevents us from accessing the Thing is the Thing itself, which is called the real. Zizek in regards to this aspect of the real uses an example of sexual pleasure in regards to virtual simulation or reality, so that if in that virtual reality ‘I stage an impossible fantasy’ the artificial enjoyment I experience will be more real than what I experience within true reality. \u2028This idea can be further conceived in the idea of the sign in opposition to the signifier. The sign is ‘preserving the continuity with the real’ and the signifier is the Thing. The real in this way is not outside of the symbolic, the real is indeed the ‘symbolic itself in the modality of non-all.’ What separates the real and the symbolic is a symbolic gesture ‘par excellence.’ Zizek does make the distinction that the ‘founding gesture’ of the Symbolic and the step to the real does not require abandoning language but it is ‘dropping the very allusion to some external point of reference which eludes the symbolic.’ \u2028To fully grasp the real, it must be put into place in regards to its function with the imaginary and symbolic. This is seen in regards to a triangle with the three points being that of imaginary, symbolic, and real. So that the there is a process of symbolization of the imaginary which can be found as the signifier of the lack in the big Other. There is then a hole in the real that sets in motion symbolization, this hole is the objet petit a. Finally we have the ‘imaginarization of the real’ which is an image which ‘materializes nauseous enjoyment.’ We then come to an abyss of enjoyment, or jouissance that is within the center of this triangle. And the three sides of the triangle according to Zizek are ‘the three ways to maintain a kind of distance toward this traumatic central abyss.’ \u2028The best example of the real comes from Face Off with John Travolta and Nicholas Cage. The real would be the raw flesh verses the imaginary which would be the masks we wear. The real can be found in another movie, The Matrix where we can see that there is a ‘screen that separates us from the Real.’ The real is also the screen at the same time, the screen that is distorting our perception of reality out there. Zizek attributes the Real to both Hegel and Kant in philosophical terms. According to Zizek, Kant’s real is found in the noumenal domain that we perceive through the ‘screen of transcendental categories.’ Whereas Zizek says that Hegel asserts that this Kantian Gap is false. Hegel introduces three terms so that when the screen \u2028‘intervenes between ourselves and the Real, it always generates a notion of what is in-itself, beyond the screen (of the appearance), so that the gap between appearance and the in-itself is always already for us. Consequently, if we subtract from the Thing the distortion of the screen, we lose the Thing itself…’ \u2028\u2028Zizek points out that when we find what is beyond reality, or the real, it is a desert. The key example is from The Matrix where when the hero is awakened and sees the remains of Chicago after global war. Morpheus then follows with the statement ‘Welcome to the Desert of the Real.’ For Zizek this same sort of effect is what happened with the World Trade Center towers on September 11th. The citizens of New York were introduced to the ‘Desert of the Real’ because such attacks were never within reality for them before. It is exactly because Americans always thought that terrorist activity only happened to other countries and not to the United States. This shows that Americans make a distinction of an Us and Them story in regards to First world and the Third World that is the ‘desert of the real.’ To Further understand Zizek’s point, he shows us that America had long since had fantasized about such occurrences within Hollywood’s blockbuster films of such nature as Independence Day. \u2028The point of psychoanalysis is to sort of answer the American question of why such a catastrophe shattered their lives. So that psychoanalysis is not confronting reality as it really is for Zizek. It is the Lacanian notion that it should conclude in ‘traversing the fantasy’ by which it is meant that one is ‘fully identifying oneself with the fantasy…’ This makes sense according to Zizek because it is ‘only in dreams that we encounter the real of our desire.’ And our everyday social reality is a sort of screen that can be ‘at any moment torn aside by an intrusion of the real.’ However, the real can only be experienced within this sort of ‘nightmarish apparition’ which is an ‘unreal spectre.’ The monstrosity that is referred to is ‘brought home when, through the mediation of scientific knowledge, new, unnatural objects become part of our daily reality.’ \u2028There is a delicate balance for the real and reality of our daily lives. The real does erupt ‘in the form of a traumatic return, derailing the balance of our daily lives, but it serves at the same time as a support of this very balance.’ The first response when this balance is interrupted and the loss of reality causes the encounter with the real is to conceive oneself as ‘radically responsible for the intrusion of the real.’ The real always for Zizek serves in supporting our symbolic reality and this type of real cannot be produced but only found. This is the lesson in regards also to the sublime object, though any ‘object can occupy the empty place of the Thing, it can do so only by the means of the illusion that it was always already there, i.e., that it was not placed there by us but found there as an “answer of the real.”’ \u2028There is an irreducible gap that separates the real from the modes of symbolization of the real. According to Zizek, there is only one proper attitude and it is \u2028‘that which fully assumes this gap as something that defines our very condition humaine, without endeavoring to suspend it through fetishistic disavowal, to keep it concealed through obsessive activity, or to reduce the gap between the real and the symbolic by projecting a message into the real.’ \u2028\u2028The horror that was experienced with the WTC attacks was one of the gap of the real falling apart. It is exactly when this gap closes that we have the real ripping into reality. The real and reality must maintain their opposition or according to Zizek ‘reality turns into a malleable, indefinitely plastic texture which, precisely, loses the character of reality, and turns into a fantasmatic effect of discursive practices.’ There is an obverse of this for the real, so that the ultimate experience of the real is ‘not that of reality which shatters illusions, but that of an illusion which irrationally persists against the pressure of reality, which does not give way to reality.’ The real and reality are different in that ‘the sameness, the overlapping features in the multitude of narratives, signals the reality of what actually took place, while the insignificant omissions or added details allude to the Real of the dream.’ \u2028The real for Zizek is something that we have a passion for. This ‘passion for the Real’ is for Zizek seen in our seeking the thrill of ‘the Real as the ultimate effect, sought after from digitalized special effects, through reality TV and amateur pornography, up to snuff movies.’ Zizek uses the example of the 1998 blockbuster The Truman Show. Maybe even better an example could be American televisions obsession with reality shows in the past 2 years. How many Survivor series have we seen come about in the past year already? There is a twist however, Zizek talks about the twentieth century passion for the real as a ‘fake passion’ in which the ‘ruthless pursuit of the real behind appearances was the ultimate stratagem to avoid confronting the real.’ So the passion for the real was really an attempt to avoid the real in any way possible. What lies at the very core of the passion for the real is a heroic gesture of taking on fully the ‘dirty obscene underside of power.’ The passion for the real is expressed in fundamentalist terror, so that there goal is to introduce us to the real by awakening us and opening the screen from reality and exposing us to the real. \u2028There are two types of the passion for the real that Zizek makes as a distinction, the first is the ‘reactionary’ the second is ‘progressive’ and these two are opposed. The reactionary passion is the passion that is the passion spoken of as endorsing the obscene underside of the Law. The progressive passion is a ‘confrontation with the real of the antagonism denied by the “passion for purification.”’ There is a change in the real for this progressive passion, it is not the terrifying thing that cannot be confronted face to face, however it is a ‘fantasmatic spectre whose presence guarantees the consistency of our symbolic edifice…’ It is this spectre that conceals the antagonism. For the Nazi’s it was the Jew that was the real in this way, and for the United States today it is terrorist organizations such as Al-Qaeda. \u2028The passion for the real has an opposition in the passion for semblance which obversely ends up in a violent return. It is here that we find Zizek saying that Levi-Strauss gives the view that Nietzsche could not in regards to reality in this way, so that everything is not merely interplay of appearances. According to Zizek it is here that it is being admitted that there is a Real and it is the gap that prevents our access to the inaccessible Thing. It is this real, the ‘real as impossible’, that causes impossibility of having a neutral view of the object. \u2028There is also a Void of the real which has two fundamental ways of relating to it. The void can either serve as the impossible real that is the limit of human experience and ‘the absolute thing toward which we have to maintain a proper distance.’ Or we can place it as something which through we should pass, this is the Hegelian ‘tarrying with the negative’ according to Zizek. We now have objects then that are ‘nothing but the Void of the Thing embodied.’",
    "author": "C. James",
    "created_at": "2025-10-24T14:15:00Z",
    "updated_at": null,
    "tags": ["philosophy", "zizek", "lacna"]
  },

]